; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p7---int100n150-m25---int100c150---s57---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 level127 level128 level129 level130 level131 level132 level133 level134 level135 level136 level137 level138 - fuellevel
)

(:init
(sum level0 level22 level22)
(sum level0 level24 level24)
(sum level1 level22 level23)
(sum level1 level24 level25)
(sum level2 level22 level24)
(sum level2 level24 level26)
(sum level3 level22 level25)
(sum level3 level24 level27)
(sum level4 level22 level26)
(sum level4 level24 level28)
(sum level5 level22 level27)
(sum level5 level24 level29)
(sum level6 level22 level28)
(sum level6 level24 level30)
(sum level7 level22 level29)
(sum level7 level24 level31)
(sum level8 level22 level30)
(sum level8 level24 level32)
(sum level9 level22 level31)
(sum level9 level24 level33)
(sum level10 level22 level32)
(sum level10 level24 level34)
(sum level11 level22 level33)
(sum level11 level24 level35)
(sum level12 level22 level34)
(sum level12 level24 level36)
(sum level13 level22 level35)
(sum level13 level24 level37)
(sum level14 level22 level36)
(sum level14 level24 level38)
(sum level15 level22 level37)
(sum level15 level24 level39)
(sum level16 level22 level38)
(sum level16 level24 level40)
(sum level17 level22 level39)
(sum level17 level24 level41)
(sum level18 level22 level40)
(sum level18 level24 level42)
(sum level19 level22 level41)
(sum level19 level24 level43)
(sum level20 level22 level42)
(sum level20 level24 level44)
(sum level21 level22 level43)
(sum level21 level24 level45)
(sum level22 level22 level44)
(sum level22 level24 level46)
(sum level23 level22 level45)
(sum level23 level24 level47)
(sum level24 level22 level46)
(sum level24 level24 level48)
(sum level25 level22 level47)
(sum level25 level24 level49)
(sum level26 level22 level48)
(sum level26 level24 level50)
(sum level27 level22 level49)
(sum level27 level24 level51)
(sum level28 level22 level50)
(sum level28 level24 level52)
(sum level29 level22 level51)
(sum level29 level24 level53)
(sum level30 level22 level52)
(sum level30 level24 level54)
(sum level31 level22 level53)
(sum level31 level24 level55)
(sum level32 level22 level54)
(sum level32 level24 level56)
(sum level33 level22 level55)
(sum level33 level24 level57)
(sum level34 level22 level56)
(sum level34 level24 level58)
(sum level35 level22 level57)
(sum level35 level24 level59)
(sum level36 level22 level58)
(sum level36 level24 level60)
(sum level37 level22 level59)
(sum level37 level24 level61)
(sum level38 level22 level60)
(sum level38 level24 level62)
(sum level39 level22 level61)
(sum level39 level24 level63)
(sum level40 level22 level62)
(sum level40 level24 level64)
(sum level41 level22 level63)
(sum level41 level24 level65)
(sum level42 level22 level64)
(sum level42 level24 level66)
(sum level43 level22 level65)
(sum level43 level24 level67)
(sum level44 level22 level66)
(sum level44 level24 level68)
(sum level45 level22 level67)
(sum level45 level24 level69)
(sum level46 level22 level68)
(sum level46 level24 level70)
(sum level47 level22 level69)
(sum level47 level24 level71)
(sum level48 level22 level70)
(sum level48 level24 level72)
(sum level49 level22 level71)
(sum level49 level24 level73)
(sum level50 level22 level72)
(sum level50 level24 level74)
(sum level51 level22 level73)
(sum level51 level24 level75)
(sum level52 level22 level74)
(sum level52 level24 level76)
(sum level53 level22 level75)
(sum level53 level24 level77)
(sum level54 level22 level76)
(sum level54 level24 level78)
(sum level55 level22 level77)
(sum level55 level24 level79)
(sum level56 level22 level78)
(sum level56 level24 level80)
(sum level57 level22 level79)
(sum level57 level24 level81)
(sum level58 level22 level80)
(sum level58 level24 level82)
(sum level59 level22 level81)
(sum level59 level24 level83)
(sum level60 level22 level82)
(sum level60 level24 level84)
(sum level61 level22 level83)
(sum level61 level24 level85)
(sum level62 level22 level84)
(sum level62 level24 level86)
(sum level63 level22 level85)
(sum level63 level24 level87)
(sum level64 level22 level86)
(sum level64 level24 level88)
(sum level65 level22 level87)
(sum level65 level24 level89)
(sum level66 level22 level88)
(sum level66 level24 level90)
(sum level67 level22 level89)
(sum level67 level24 level91)
(sum level68 level22 level90)
(sum level68 level24 level92)
(sum level69 level22 level91)
(sum level69 level24 level93)
(sum level70 level22 level92)
(sum level70 level24 level94)
(sum level71 level22 level93)
(sum level71 level24 level95)
(sum level72 level22 level94)
(sum level72 level24 level96)
(sum level73 level22 level95)
(sum level73 level24 level97)
(sum level74 level22 level96)
(sum level74 level24 level98)
(sum level75 level22 level97)
(sum level75 level24 level99)
(sum level76 level22 level98)
(sum level76 level24 level100)
(sum level77 level22 level99)
(sum level77 level24 level101)
(sum level78 level22 level100)
(sum level78 level24 level102)
(sum level79 level22 level101)
(sum level79 level24 level103)
(sum level80 level22 level102)
(sum level80 level24 level104)
(sum level81 level22 level103)
(sum level81 level24 level105)
(sum level82 level22 level104)
(sum level82 level24 level106)
(sum level83 level22 level105)
(sum level83 level24 level107)
(sum level84 level22 level106)
(sum level84 level24 level108)
(sum level85 level22 level107)
(sum level85 level24 level109)
(sum level86 level22 level108)
(sum level86 level24 level110)
(sum level87 level22 level109)
(sum level87 level24 level111)
(sum level88 level22 level110)
(sum level88 level24 level112)
(sum level89 level22 level111)
(sum level89 level24 level113)
(sum level90 level22 level112)
(sum level90 level24 level114)
(sum level91 level22 level113)
(sum level91 level24 level115)
(sum level92 level22 level114)
(sum level92 level24 level116)
(sum level93 level22 level115)
(sum level93 level24 level117)
(sum level94 level22 level116)
(sum level94 level24 level118)
(sum level95 level22 level117)
(sum level95 level24 level119)
(sum level96 level22 level118)
(sum level96 level24 level120)
(sum level97 level22 level119)
(sum level97 level24 level121)
(sum level98 level22 level120)
(sum level98 level24 level122)
(sum level99 level22 level121)
(sum level99 level24 level123)
(sum level100 level22 level122)
(sum level100 level24 level124)
(sum level101 level22 level123)
(sum level101 level24 level125)
(sum level102 level22 level124)
(sum level102 level24 level126)
(sum level103 level22 level125)
(sum level103 level24 level127)
(sum level104 level22 level126)
(sum level104 level24 level128)
(sum level105 level22 level127)
(sum level105 level24 level129)
(sum level106 level22 level128)
(sum level106 level24 level130)
(sum level107 level22 level129)
(sum level107 level24 level131)
(sum level108 level22 level130)
(sum level108 level24 level132)
(sum level109 level22 level131)
(sum level109 level24 level133)
(sum level110 level22 level132)
(sum level110 level24 level134)
(sum level111 level22 level133)
(sum level111 level24 level135)
(sum level112 level22 level134)
(sum level112 level24 level136)
(sum level113 level22 level135)
(sum level113 level24 level137)
(sum level114 level22 level136)
(sum level114 level24 level138)
(sum level115 level22 level137)
(sum level116 level22 level138)

(connected l0 l1)
(fuelcost level22 l0 l1)
(connected l0 l2)
(fuelcost level24 l0 l2)
(connected l1 l0)
(fuelcost level22 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l2 l0)
(fuelcost level24 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)

(at t0 l1)
(fuel t0 level138)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l2)
(at p4 l0)
(at p5 l1)
(at p6 l2)
)

(:goal
(and
(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l1)
(at p4 l2)
(at p5 l0)
(at p6 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 0 of 7
2. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 7
3. (drive t0 l1 l2 level114 level24 level138)
   deleted: (at t0 l1) (fuel t0 level138)
   added: (at t0 l2) (fuel t0 level114)
   goals met: 0 of 7
4. (load p6 t0 l2)
   deleted: (at p6 l2)
   added: (in p6 t0)
   goals met: 0 of 7
5. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 7
6. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 7
7. (drive t0 l2 l0 level90 level24 level114)
   deleted: (at t0 l2) (fuel t0 level114)
   added: (at t0 l0) (fuel t0 level90)
   goals met: 0 of 7
8. (unload p5 t0 l0)
   deleted: (in p5 t0)
   added: (at p5 l0)
   goals met: 1 of 7
9. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 2 of 7
10. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 2 of 7
11. (drive t0 l0 l1 level68 level22 level90)
   deleted: (at t0 l0) (fuel t0 level90)
   added: (at t0 l1) (fuel t0 level68)
   goals met: 2 of 7
12. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 2 of 7
13. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 3 of 7
14. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 4 of 7
15. (drive t0 l1 l2 level44 level24 level68)
   deleted: (at t0 l1) (fuel t0 level68)
   added: (at t0 l2) (fuel t0 level44)
   goals met: 4 of 7
16. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 5 of 7
17. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 6 of 7
18. (unload p4 t0 l2)
   deleted: (in p4 t0)
   added: (at p4 l2)
   goals met: 7 of 7
